backbone:
  # [from, repeats, module, args]
  - [-1, 1, tf_mobilenetv3_large_075, [
    "https://github.com/rwightman/pytorch-image-models/releases/download/v0.1-weights/tf_mobilenetv3_large_075-150ee8b0.pth",
    1, 2, 3, 5, 6]]
  - [-1, 1, LightConv, [48, 3, 2, None, 1, 1, False]] # 5
  - [-1, 1, LightConv, [42, 3, 2, None, 1, 1, False]] # 6
  - [-1, 1, LightConv, [42, 3, 1, None, 1, 1, False]] # 7

head:
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]  # 8
  - [4, 1, LightConv, [42, 3, 1, None, 1, 1, False]] # 9
  - [[-1, -2], 1, Shortcut, []] # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [3, 1, LightConv, [42, 3, 1, None, 1, 1, False]] # 12
  - [[-1, -2], 1, Shortcut, []] # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [2, 1, LightConv, [42, 3, 1, None, 1, 1, False]] # 15
  - [[-1, -2], 1, Shortcut, []] # 16
  - [-1, 1, LightConv, [42, 3, 1]] # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [1, 1, LightConv, [42, 3, 1, None, 1, 1, False]] # 19
  - [[-1, -2], 1, Shortcut, []] # 20
  - [11, 1, LightConv, [42, 3, 1]] # 21
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 22
  - [[-1, -3], 1, Shortcut, []] # 23
  - [-1, 1, LightConv, [42, 3, 1]] # 24
  - [-1, 1, LightConv, [64, 3, 1]] # 25
  - [-1, 1, Semantic, [3, 4]]