backbone:
  # [from, repeats, module, args]
  - [-1, 1, tf_mobilenetv3_large_075, [
    "https://github.com/rwightman/pytorch-image-models/releases/download/v0.1-weights/tf_mobilenetv3_large_075-150ee8b0.pth"]]


head:
  # encoder [16, 24, 32, 88, 720]
  # [256, 128, 64, 32, 16]
  # block 5
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, UNetDecoderBlock, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, UNetDecoderBlock, [128]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, UNetDecoderBlock, [64]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 0], 1, UNetDecoderBlock, [32]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, UNetDecoderBlock, [16]]
  - [-1, 1, SegmentationHead, [3]]
